In [1]:
import pandas as pd
import numpy as np

In [2]:


data = {
  'ФИО': [
    'Иван Иванов', 'Петр Петров', 'Светлана Смирнова', 'Алексей Федоров', 'Мария Кузнецова',
    'Олег Соколов', 'Елена Чернова', 'Руслан Зайцев', 'Галина Лебедева', 'Дмитрий Ковалев',
    'Оксана Никитина', 'Виктор Беляев', 'Надежда Михайлова', 'Сергей Карпов', 'Татьяна Попова'
  ],
  'Должность': [
    'Аналитик', 'Менеджер', 'Бухгалтер', 'Аналитик', 'Маркетолог', 'Менеджер',
    'HR', 'Аналитик', 'Менеджер', 'Бухгалтер', 'Аналитик', 'Юрист', 'HR', 'Маркетолог', 'Дизайнер'
  ],
  'Возраст': [28, 34, 29, 31, 27, 38, 30, 33, 35, 40, 26, 42, 29, 32, 25],
  'Город': [
    'Душанбе', 'Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Минск',
    'Киев', 'Алматы', 'Бишкек', 'Ташкент', 'Омск', 'Самара', 'Воронеж', 'Казань', 'Ростов-на-Дону'
  ]
}


df_staff = pd.DataFrame(data)
df_staff.set_index("ФИО", inplace=True)


print(df_staff[df_staff['Возраст'] > 30])

                  Должность  Возраст        Город
ФИО
Петр Петров        Менеджер       34       Москва
Алексей Федоров    Аналитик       31  Новосибирск
Олег Соколов       Менеджер       38        Минск
Руслан Зайцев      Аналитик       33       Алматы
Галина Лебедева    Менеджер       35       Бишкек
Дмитрий Ковалев   Бухгалтер       40      Ташкент
Виктор Беляев         Юрист       42       Самара
Сергей Карпов    Маркетолог       32       Казань

In [3]:

data = {
    'Дата': list(pd.date_range(start='2025-09-01', periods=15, freq='D').strftime('%Y-%m-%d')),
    'Товар': ['Ноутбук', 'Телефон', 'Планшет', 'Наушники', 'Монитор', 'Клавиатура',
              'Мышь', 'Принтер', 'Флешка', 'Веб-камера', 'Смарт-часы', 'Router',
              'Powerbank', 'Микрофон', 'SSD'],
    'Количество': [2, 5, 3, 4, 1, 6, 5, 2, 10, 3, 7, 4, 8, 2, 3],
    'Цена_за_единицу': [800, 500, 300, 50, 200, 40, 30, 150, 20, 70, 250, 100, 35, 80, 120]
}


df_orders = pd.DataFrame(data)
df_orders['Общая_стоимость'] = df_orders['Количество'] * df_orders['Цена_за_единицу']

df_orders.rename(columns={'Товар': 'Категория'}, inplace=True)
df_orders_final = df_orders.drop(columns=['Количество'])

df_orders_final.loc[df_orders_final['Категория'] == 'Флешка', 'Цена_за_единицу'] = 25
df_orders_final.loc[df_orders_final['Категория'] == 'Флешка', 'Общая_стоимость'] = (
    25 * 10  
)

print(df_orders_final)

          Дата   Категория  Цена_за_единицу  Общая_стоимость
0   2025-09-01     Ноутбук              800             1600
1   2025-09-02     Телефон              500             2500
2   2025-09-03     Планшет              300              900
3   2025-09-04    Наушники               50              200
4   2025-09-05     Монитор              200              200
5   2025-09-06  Клавиатура               40              240
6   2025-09-07        Мышь               30              150
7   2025-09-08     Принтер              150              300
8   2025-09-09      Флешка               25              250
9   2025-09-10  Веб-камера               70              210
10  2025-09-11  Смарт-часы              250             1750
11  2025-09-12      Router              100              400
12  2025-09-13   Powerbank               35              280
13  2025-09-14    Микрофон               80              160
14  2025-09-15         SSD              120              360

In [4]:



data = {
  'Студент': ['Иванов', 'Петров', 'Сидоров', 'Кузнецов', 'Смирнова', 'Воробьева', 'Федоров',
               'Лебедев', 'Михайлова', 'Кириллов', 'Яковлев', 'Андреев', 'Егоров', 'Борисов', 'Громов'],
  'Предмет': ['Математика', 'Физика', 'Литература', 'Информатика', 'Химия', 'Физика', 'Математика',
               'Литература', 'Информатика', 'Физика', 'Математика', 'Химия', 'Литература', 'Информатика', 'Физика'],
  'Оценка': [90, 75, 85, 95, 70, 88, 92, 78, 96, 65, 89, 80, 83, 91, 72],
  'Дата_экзамена': [
    '2025-09-15', '2025-09-16', '2025-09-17', '2025-09-18', '2025-09-19',
    '2025-09-20', '2025-09-21', '2025-09-22', '2025-09-23', '2025-09-24',
    '2025-09-25', '2025-09-26', '2025-09-27', '2025-09-28', '2025-09-29'
  ]
}

df_exams = pd.DataFrame(data)


inform_high = df_exams[(df_exams['Предмет'] == 'Информатика') & (df_exams['Оценка'] > 90)]
print("Студенты с высоким баллом по информатике (>90):")
print(inform_high, '\n')


physics_low = df_exams[(df_exams['Предмет'] == 'Физика') & (df_exams['Оценка'] < 75)]
print("Студенты с низкой оценкой по физике (<75):")
print(physics_low, '\n')


count_inform_high = inform_high.shape[0]
count_physics_low = physics_low.shape[0]

print(f"Количество студентов с высоким баллом по информатике: {count_inform_high}")
print(f"Количество студентов с низкой оценокой по физеке: {count_physics_low}")

Студенты с высоким баллом по информатике (>90):
      Студент      Предмет  Оценка Дата_экзамена
3    Кузнецов  Информатика      95    2025-09-18
8   Михайлова  Информатика      96    2025-09-23
13    Борисов  Информатика      91    2025-09-28

Студенты с низкой оценкой по физике (<75):
     Студент Предмет  Оценка Дата_экзамена
9   Кириллов  Физика      65    2025-09-24
14    Громов  Физика      72    2025-09-29

Количество студентов с высоким баллом по информатике: 3
Количество студентов с низкой оценокой по физеке: 2

In [5]:
data = {
  'Модель': ['Toyota Corolla', 'Honda Civic', 'Ford Focus', 'Hyundai Elantra', 'BMW 3 Series',
             'Audi A4', 'Kia Rio', 'Volkswagen Golf', 'Skoda Octavia', 'Renault Logan',
             'Lada Vesta', 'Nissan Qashqai', 'Mercedes A-Class', 'Peugeot 308', 'Mazda 3'],
  'Тип': ['Седан', 'Седан', 'Седан', 'Седан', 'Седан', 'Седан', 'Седан', 'Хэтчбек', 'Хэтчбек', 'Седан',
           'Седан', 'Кроссовер', 'Хэтчбек', 'Хэтчбек', 'Седан'],
  'Год_выпуска': [2019, 2018, 2020, 2021, 2017, 2019, 2022, 2016, 2018, 2020, 2023, 2021, 2019, 2017, 2022],
  'Пробег': [45000, 60000, 30000, 25000, 70000, 55000, 15000, 80000, 50000, 40000, 10000, 20000, 35000, 65000, 12000],
  'Цена': [15000, 13000, 16000, 17000, 22000, 21000, 14000, 12000, 13500, 11000, 9000, 19000, 23000, 12500, 18000]
}

df_cars = pd.DataFrame(data)
recen_low_mileage = df_cars[(df_cars['Год_выпуска'] >= 2019) & (df_cars['Пробег'] <= 50000)]
print("Недавние автомобили с низким пробегом:")
print(recen_low_mileage)
affordable_cars = recen_low_mileage[recen_low_mileage['Цена'] < 18000]
print("\nДоступные автомобили (цена < 18000):")
print(affordable_cars)

Недавние автомобили с низким пробегом:
              Модель        Тип  Год_выпуска  Пробег   Цена
0     Toyota Corolla      Седан         2019   45000  15000
2         Ford Focus      Седан         2020   30000  16000
3    Hyundai Elantra      Седан         2021   25000  17000
6            Kia Rio      Седан         2022   15000  14000
9      Renault Logan      Седан         2020   40000  11000
10        Lada Vesta      Седан         2023   10000   9000
11    Nissan Qashqai  Кроссовер         2021   20000  19000
12  Mercedes A-Class    Хэтчбек         2019   35000  23000
14           Mazda 3      Седан         2022   12000  18000

Доступные автомобили (цена < 18000):
             Модель    Тип  Год_выпуска  Пробег   Цена
0    Toyota Corolla  Седан         2019   45000  15000
2        Ford Focus  Седан         2020   30000  16000
3   Hyundai Elantra  Седан         2021   25000  17000
6           Kia Rio  Седан         2022   15000  14000
9     Renault Logan  Седан         2020   40000  11000
10       Lada Vesta  Седан         2023   10000   9000

#Дубликаты данных

In [6]:
df = pd.DataFrame({
    'id': [1, 2, 3, 4, 3],
    'app_id': [101, 102, 103, 104, 103],
    'name': ['A', 'A', 'B', 'C', 'C'],
    'age': [20, 25, 30, 22, 22]
})

df.loc[5] = [3, 106, "B", 30]

In [7]:
df

   id  app_id name  age
0   1     101    A   20
1   2     102    A   25
2   3     103    B   30
3   4     104    C   22
4   3     103    C   22
5   3     106    B   30

In [8]:
df[df.duplicated()]

Empty DataFrame
Columns: [id, app_id, name, age]
Index: []

In [9]:


data = {
  'Сотрудник': ['Иванов', 'Петров', 'Сидоров', 'Кузнецов', 'Смирнова', 'Воробьева', 'Федоров', 'Лебедев',
                'Михайлова', 'Кириллов', 'Яковлев', 'Андреев', 'Егоров', 'Борисов', 'Громов'],
  'Количество': [10, 8, 15, 20, 12, 18, 9, 11, 14, 13, 16, 7, 17, 19, 10],
  'Цена_единицы': [100, 150, 200, 120, 130, 80, 90, 110, 170, 60, 150, 140, 100, 105, 95]
}

df_sales = pd.DataFrame(data)

def calc_revenue(row):
    return row['Количество'] * row['Цена_единицы']


def calc_bonus(revenue):
    return revenue * 0.10  # 10%


df_sales['Выручка'] = df_sales.apply(calc_revenue, axis=1)
df_sales['Бонус'] = df_sales['Выручка'].apply(calc_bonus)

df_sales

    Сотрудник  Количество  Цена_единицы  Выручка  Бонус
0      Иванов          10           100     1000  100.0
1      Петров           8           150     1200  120.0
2     Сидоров          15           200     3000  300.0
3    Кузнецов          20           120     2400  240.0
4    Смирнова          12           130     1560  156.0
5   Воробьева          18            80     1440  144.0
6     Федоров           9            90      810   81.0
7     Лебедев          11           110     1210  121.0
8   Михайлова          14           170     2380  238.0
9    Кириллов          13            60      780   78.0
10    Яковлев          16           150     2400  240.0
11    Андреев           7           140      980   98.0
12     Егоров          17           100     1700  170.0
13    Борисов          19           105     1995  199.5
14     Громов          10            95      950   95.0

In [10]:
data = {
  'Пациент': ['Алексей', 'Борис', 'Виктор', 'Геннадий', 'Дмитрий', 'Елена', 'Жан', 'Зоя', 'Игорь', 'Клара',
               'Леонид', 'Майя', 'Николай', 'Ольга', 'Павел'],
  'Диагноз': ['Грипп', 'ОРВИ', np.nan, 'Ангина', 'Грипп', np.nan, 'ОРВИ', 'Грипп', 'Ангина', np.nan,
              'Грипп', 'Ангина', 'ОРВИ', 'Грипп', np.nan],
  'Возраст': [25, 34, 29, 40, 22, 31, 28, 37, 45, 33, 36, 27, 30, 39, 24],
  'Группа_риска': ['низкая', np.nan, 'средняя', 'высокая', np.nan, 'средняя', 'низкая', 'высокая',
                    'высокая', 'средняя', np.nan, 'низкая', 'низкая', 'высокая', np.nan]
}


df_patients = pd.DataFrame(data)


print("Пропуски по столбцам:")
print(df_patients.isna().sum())


df_patients_clean = df_patients.dropna()


print("\nРазмеры таблиц:")
print("Исходная:", df_patients.shape)
print("Очищенная:", df_patients_clean.shape)


df_patients_clean.to_csv("patients_clean.csv", index=False)

df_patients_clean

Пропуски по столбцам:
Пациент         0
Диагноз         4
Возраст         0
Группа_риска    4
dtype: int64

Размеры таблиц:
Исходная: (15, 4)
Очищенная: (8, 4)

     Пациент Диагноз  Возраст Группа_риска
0    Алексей   Грипп       25       низкая
3   Геннадий  Ангина       40      высокая
6        Жан    ОРВИ       28       низкая
7        Зоя   Грипп       37      высокая
8      Игорь  Ангина       45      высокая
11      Майя  Ангина       27       низкая
12   Николай    ОРВИ       30       низкая
13     Ольга   Грипп       39      высокая

In [11]:

data = {
  'Время': [str(dt) for dt in pd.date_range(start='2025-10-01 00:00', periods=15, freq='H')],
  'Температура': [20.1, np.nan, 19.8, 20.3, 19.9, np.nan, 20.2, 19.7, 20.0, np.nan, 19.8, 20.1, 19.6, 20.4, 19.9],
  'Влажность': [65, 66, np.nan, 64, 67, 63, 65, np.nan, 66, 68, 64, 65, np.nan, 67, 66],
  'Давление': [1012, 1013, 1011, np.nan, 1014, 1012, 1013, 1011, 1012, 1010, np.nan, 1013, 1012, 1014, 1011]
}

df_sensors = pd.DataFrame(data)


print("Пропуски по столбцам:")
print(df_sensors.isna().sum())


df_sensors_clean = df_sensors.dropna(subset=['Температура', 'Влажность', 'Давление'], how='all')


print("\nИтоговый DataFrame:")
print(df_sensors_clean)

Пропуски по столбцам:
Время          0
Температура    3
Влажность      3
Давление       2
dtype: int64

Итоговый DataFrame:
                  Время  Температура  Влажность  Давление
0   2025-10-01 00:00:00         20.1       65.0    1012.0
1   2025-10-01 01:00:00          NaN       66.0    1013.0
2   2025-10-01 02:00:00         19.8        NaN    1011.0
3   2025-10-01 03:00:00         20.3       64.0       NaN
4   2025-10-01 04:00:00         19.9       67.0    1014.0
5   2025-10-01 05:00:00          NaN       63.0    1012.0
6   2025-10-01 06:00:00         20.2       65.0    1013.0
7   2025-10-01 07:00:00         19.7        NaN    1011.0
8   2025-10-01 08:00:00         20.0       66.0    1012.0
9   2025-10-01 09:00:00          NaN       68.0    1010.0
10  2025-10-01 10:00:00         19.8       64.0       NaN
11  2025-10-01 11:00:00         20.1       65.0    1013.0
12  2025-10-01 12:00:00         19.6        NaN    1012.0
13  2025-10-01 13:00:00         20.4       67.0    1014.0
14  2025-10-01 14:00:00         19.9       66.0    1011.0

C:\Users\user\AppData\Local\Temp\ipykernel_9856\3185147892.py:2: FutureWarning: 'H' is deprecated and will be removed in a future version, please use 'h' instead.
  'Время': [str(dt) for dt in pd.date_range(start='2025-10-01 00:00', periods=15, freq='H')],

In [12]:
data = {
  'Продукт': ['Молоко', 'Хлеб', 'Яблоки', 'Мясо', 'Рис', 'Сахар', 'Картофель', 'Сыр', 'Макароны',
              'Йогурт', 'Колбаса', 'Масло', 'Чай', 'Кофе', 'Курица'],
  'Категория': ['Молочная', 'Выпечка', np.nan, 'Мясо', np.nan, 'Сладости', 'Овощи', np.nan, 'Бакалея', 'Молочная',
                'Колбасы', 'Молочная', 'Напитки', 'Напитки', np.nan],
  'Цена': [1.5, 0.8, 2.3, 5.0, 1.2, 0.9, 1.0, 4.5, 1.1, 0.7, 3.5, 2.0, 1.8, 3.2, 4.0],
  'Количество': [50, np.nan, 30, 20, np.nan, 40, 60, 15, 70, 25, 35, np.nan, 45, 30, 20]
}


df_inventory = pd.DataFrame(data)


print("Типы данных в таблице:")
print(df_inventory.dtypes)



numeric_cols = df_inventory.select_dtypes(include=['float64', 'int64']).columns
for col in numeric_cols:
    df_inventory[col] = df_inventory[col].fillna(df_inventory[col].mean())

cat_cols = df_inventory.select_dtypes(include=['object']).columns
for col in cat_cols:
    df_inventory[col] = df_inventory[col].fillna(df_inventory[col].mode()[0])


print("\nТаблица после заполнения пропусков:")
print(df_inventory)


df_inventory.to_csv("inventory_filled.csv", index=False)

Типы данных в таблице:
Продукт        object
Категория      object
Цена          float64
Количество    float64
dtype: object

Таблица после заполнения пропусков:
      Продукт Категория  Цена  Количество
0      Молоко  Молочная   1.5   50.000000
1        Хлеб   Выпечка   0.8   36.666667
2      Яблоки  Молочная   2.3   30.000000
3        Мясо      Мясо   5.0   20.000000
4         Рис  Молочная   1.2   36.666667
5       Сахар  Сладости   0.9   40.000000
6   Картофель     Овощи   1.0   60.000000
7         Сыр  Молочная   4.5   15.000000
8    Макароны   Бакалея   1.1   70.000000
9      Йогурт  Молочная   0.7   25.000000
10    Колбаса   Колбасы   3.5   35.000000
11      Масло  Молочная   2.0   36.666667
12        Чай   Напитки   1.8   45.000000
13       Кофе   Напитки   3.2   30.000000
14     Курица  Молочная   4.0   20.000000

In [17]:

print("\nРезультат df_inventory['Категория'].mode()[0]:")
print(df_inventory['Категория'].value_counts())

Результат df_inventory['Категория'].mode()[0]:
Категория
Молочная    7
Напитки     2
Мясо        1
Выпечка     1
Сладости    1
Овощи       1
Бакалея     1
Колбасы     1
Name: count, dtype: int64